erp3l/src/DataProcessors/СопоставлениеПланФактОперацийМСФО/СопоставлениеПланФактОперацийМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СопоставлениеПланФактОперацийМСФО</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erp3l/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Documents/НачислениеОперацийМСФО/НачислениеОперацийМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеОперацийМСФО</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
      <types>DocumentRef.УрегулированиеРасхожденияВГО</types>
      <types>DocumentRef.ОжидаемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.ОперативныйПлан</types>
      <types>DocumentRef.ПланируемыйДоход</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДвиженияНачислений</name>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДт</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКт</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВалютаКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВалютаДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеДт</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиДт</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеКт</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиКт</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ОперацияМСФО/ОперацияМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияМСФО</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ГрафикиФИ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>InformationRegister.РасчетныеДанныеРегламента</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииВНАМСФО</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияВНАМСФО</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеИнвестиций</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеЗапасы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеВНА</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьВНАМСФО</registerRecords>
  <registerRecords>InformationRegister.АрендованныеВНА</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеДЗ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетныеДанныеФИ</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаВНА</registerRecords>
  <registerRecords>AccumulationRegister.БрокерскиеСчета</registerRecords>
  <registerRecords>InformationRegister.СведенияОФИ</registerRecords>
  <registerRecords>AccumulationRegister.РезервыПоПретензиям</registerRecords>
  <registerRecords>InformationRegister.РасшифровкиГрафиковЦБ</registerRecords>
  <registerRecords>InformationRegister.СтруктураСтоимостиЗапасовМСФО</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиФакт</registerRecords>
  <registerRecords>InformationRegister.РасчетныеДанныеОН</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЦенныхБумаг</registerRecords>
  <registerRecords>InformationRegister.ДатыПоследовательностейУчастия</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаВНАМСФО</registerRecords>
  <registerRecords>InformationRegister.ОперацииПериодаФИ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТиповаяОперация</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимаяСуммаВО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеПараметры</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/DataProcessors/СопоставлениеПланФактОперацийМСФО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура СформироватьКорректировки(Отказ = Ложь) Экспорт

	Построитель = Новый ПостроительЗапроса(ПолучитьТекстЗапросаКорректировок());
	
	ВозможныеОтборы = Новый Структура("Организация,Сценарий,Контрагент,ДоговорКонтрагента,ПериодНачисления");
	Для каждого ТекОтбор Из ВозможныеОтборы Цикл
		Если (ТекОтбор.Ключ = "ПериодНачисления") И ЗначениеЗаполнено(ЭтотОбъект.ПериодНачисления) Тогда
			
			текОтбор = Построитель.Отбор.Добавить("Дата");			
			текОтбор.ВидСравнения	= ВидСравнения.ИнтервалВключаяГраницы;
			текОтбор.ЗначениеС		= ЭтотОбъект.ПериодНачисления.ДатаНачала;
			текОтбор.ЗначениеПо		= ЭтотОбъект.ПериодНачисления.ДатаОкончания;
			текОтбор.Использование 	= Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект[ТекОтбор.Ключ]) Тогда
			Построитель.Отбор.Добавить(ТекОтбор.Ключ).Установить(ЭтотОбъект[ТекОтбор.Ключ]);
		КонецЕсли;		 
	КонецЦикла;
	
	Выборка = Построитель.ПолучитьЗапрос().Выполнить().Выбрать();
	КолонкиСторно = Новый Структура("Значение,СуммаВФункциональнойВалюте,СуммаВВалютеОтчетности,КоличествоДт,КоличествоКт,ЗначениеВалютаДт,ЗначениеВалютаКт");
	
	КэшУП = Неопределено;
 
	Пока Выборка.Следующий() Цикл
		
		Периодичность = Выборка.ДокументПлан.Сценарий.Периодичность;
		Периодичность = ?(ЗначениеЗаполнено(Периодичность), Периодичность, Перечисления.Периодичность.Год);
		
		ЗначенияУП = ЗначенияУП(Выборка.ДокументПлан.Организация, КэшУП); 
		
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Период", 				Выборка.ДатаТК);
		Реквизиты.Вставить("Ссылка", 				Выборка.ДокументПлан);
		Реквизиты.Вставить("Организация", 			Выборка.ДокументПлан.Организация);
		Реквизиты.Вставить("Сценарий", 				Выборка.ДокументПлан.Сценарий);
		Реквизиты.Вставить("ФункциональнаяВалюта", 	ЗначенияУП.ФункциональнаяВалюта);		
		Реквизиты.Вставить("ВидОперации", 			Справочники.ВидыОпераций.СторноНачисленияДоходовРасходовМСФО);
		Реквизиты.Вставить("ПланСчетовМСФО", 		ЗначенияУП.ПланСчетовМСФО);
		Реквизиты.Вставить("ПериодСценария", 		ОбщегоНазначенияУХ.глОтносительныйПериодПоДате(Выборка.ДатаТК, Периодичность, 0));
		Реквизиты.Вставить("ФормироватьПроводкиМСФО", ЗначенияУП.ФормироватьПроводкиМСФО);
		
		Таб = Выборка.ДокументПлан.ДвиженияНачислений.Выгрузить();
		
		Отказ = Ложь;
		ДополнительныеСвойства = Новый Структура;
		ПроведениеСерверУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Выборка.ДокументПлан, ДополнительныеСвойства);
		ТаблицаПроводок = Документы.НачислениеОперацийМСФО.ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ, Ложь).ТаблицаПроводок;
		
		Для каждого СтрокаТаб Из ТаблицаПроводок Цикл
			
			Для каждого КолонкаТаб Из КолонкиСторно Цикл
				
				ИмяКолонки = КолонкаТаб.Ключ;
				Если ТаблицаПроводок.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаб[ИмяКолонки]) Тогда
					СтрокаТаб[ИмяКолонки] = - СтрокаТаб[ИмяКолонки];	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Реквизиты.ФормироватьПроводкиМСФО Тогда
			
			СтруктураЗаполненияРучнойОперации = ПреобразоватьРеквизиты(Реквизиты, ТаблицаПроводок);
			ПреобразованнаяТаблицаПроводок = ПреобразоватьТаблицуПроводок(ТаблицаПроводок);
			СсылкаТК = МСФОВызовСервераУХ.СформироватьОперациюМСФО(ПреобразованнаяТаблицаПроводок, СтруктураЗаполненияРучнойОперации, Отказ);
			
		ИначеЕсли ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
			
			МодульТК = ОбщегоНазначения.ОбщийМодуль("ТрансформационныеКорректировкиУХ");
			СсылкаТК = МодульТК.СформироватьКорректировку(Реквизиты, Отказ, ТаблицаПроводок);
			
		КонецЕсли;
		
		Если Отказ Или Не ЗначениеЗаполнено(СсылкаТК) Тогда
			Продолжить;
		КонецЕсли; 
		
		нз = РегистрыСведений.СопоставлениеПланФактОперацийНачисленияМСФО.СоздатьНаборЗаписей();
		
		нз.Отбор.Организация.Установить(Реквизиты.Организация);
		нз.Отбор.ДокументПлан.Установить(Реквизиты.Ссылка);
		
		нз.Прочитать();
		
		Для каждого СтрокаТаб Из нз Цикл
		    СтрокаТаб.Корректировка = СсылкаТК; 	
		КонецЦикла;
		
		нз.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначенияУП(Организация, КэшУП)

	Если КэшУП = Неопределено Тогда		
		КэшУП = Новый Соответствие;
	КонецЕсли;
	
	ЗначенияКэша = КэшУП.Получить(Организация);
	Если ЗначенияКэша <> Неопределено Тогда
		Возврат ЗначенияКэша;
	КонецЕсли;
	
	ИменаРеквизитовУП = "ФункциональнаяВалюта, ФормироватьПроводкиМСФО, ПланСчетовМСФО";
	РеквизитыУП = МСФОВызовСервераУХ.ПутиРеквизитовУП(ИменаРеквизитовУП);
	
	Таб = МСФОВызовСервераУХ.ЗначенияУП(РеквизитыУП, Организация, 
				ЭтотОбъект.ПериодНачисления.ДатаОкончания, ЭтотОбъект.Сценарий);
			
	ЗначенияКэша = Новый Структура(ИменаРеквизитовУП, Истина);
	Если Таб.Количество() Тогда
		ЗаполнитьЗначенияСвойств(ЗначенияКэша, Таб[0]);		
	Иначе 
		
		ЗначенияКэша.Вставить("ФункциональнаяВалюта", Константы.ВалютаРегламентированногоУчета.Получить());
		ЗначенияКэша.Вставить("ПланСчетовМСФО", МСФОВызовСервераУХ.ПланСчетовУП(Неопределено));
		
	КонецЕсли;	                                       
	
	КэшУП.Вставить(Организация, ЗначенияКэша);
	Возврат ЗначенияКэша;
		
КонецФункции

#КонецОбласти	

#Область СлужебныеПроцедурыИФункции

Функция ПреобразоватьРеквизиты(Реквизиты, ТаблицаПроводок)
	
	СтруктураЗаполненияРучнойОперации = Новый Структура;
	СтруктураЗаполненияРучнойОперации.Вставить("Дата", Реквизиты.Период);
	СтруктураЗаполненияРучнойОперации.Вставить("СпособЗаполнения", МСФОКлиентСерверУХ.СпособЗаполненияСторно());
	СтруктураЗаполненияРучнойОперации.Вставить("СторнируемыйДокумент", Реквизиты.Ссылка);
	СтруктураЗаполненияРучнойОперации.Вставить("Организация", Реквизиты.Организация);
	СтруктураЗаполненияРучнойОперации.Вставить("Сценарий", Реквизиты.Сценарий);
	СтруктураЗаполненияРучнойОперации.Вставить("СуммаОперации",ТаблицаПроводок.Итог("СуммаВФункциональнойВалюте"));
	Возврат СтруктураЗаполненияРучнойОперации;
	
КонецФункции

Функция ПреобразоватьТаблицуПроводок(ТаблицаПроводок)
	
	ТаблицаПроводокРучнойОперации = ТаблицаПроводок.Скопировать();
	КолонкиТаблицы = ТаблицаПроводокРучнойОперации.Колонки;
	КолонкиТаблицы.СуммаВФункциональнойВалюте.Имя = "СуммаВВалютеУчета";
	//КолонкиТаблицы.ЗначениеВалютаДт.Имя = "СуммаВВалютеДт";
	//КолонкиТаблицы.ЗначениеВалютаКт.Имя = "СуммаВВалютеКт";
	
	КолонкиТаблицы.СчетДт.Имя = "СчетДтСчетаБД";
	КолонкиТаблицы.СчетКт.Имя = "СчетКтСчетаБД";
	
	КолонкиТаблицы.Добавить("СчетДт", Новый ОписаниеТипов("ПланСчетовСсылка.МСФО"));
	КолонкиТаблицы.Добавить("СчетКт", Новый ОписаниеТипов("ПланСчетовСсылка.МСФО"));
	
	Для Каждого ТекСтрокаТаблицы Из ТаблицаПроводокРучнойОперации Цикл
		ТекСтрокаТаблицы.СчетДт = ТекСтрокаТаблицы.СчетДтСчетаБД.СчетСсылка;
		ТекСтрокаТаблицы.СчетКт = ТекСтрокаТаблицы.СчетКтСчетаБД.СчетСсылка;
	КонецЦикла;
	
	Возврат ТаблицаПроводокРучнойОперации;
	
КонецФункции

Функция ПолучитьТекстЗапросаКорректировок()
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тк.ДокументПлан КАК ДокументПлан,
		|	тк.СуммаФакт КАК СуммаФакт,
		|	тк.ДатаТК КАК ДатаТК,
		|	тк.Корректировка КАК Корректировка
		|ИЗ
		|	(ВЫБРАТЬ
		|		т.ДокументПлан КАК ДокументПлан,
		|		СУММА(т.СуммаФакт) КАК СуммаФакт,
		|		МАКСИМУМ(т.Корректировка) КАК Корректировка,
		|		МИНИМУМ(т.ДокументФакт.Дата) КАК ДатаТК
		|	ИЗ
		|		РегистрСведений.СопоставлениеПланФактОперацийНачисленияМСФО КАК т
		|	{ГДЕ
		|		т.Организация.*,
		|		т.ДокументПлан.Сценарий.* КАК Сценарий,
		|		т.ДокументПлан.Дата КАК Дата,
		|		т.ДокументПлан.Контрагент.* КАК Контрагент,
		|		т.ДокументПлан.ДоговорКонтрагента.* КАК ДоговорКонтрагента}
		|	
		|	СГРУППИРОВАТЬ ПО
		|		т.ДокументПлан) КАК тк
		|ГДЕ
		|	&УсловиеПоТипуКонфигурации
		|	И (тк.ДокументПлан.Сумма <> тк.СуммаФакт
		|			ИЛИ тк.Корректировка В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Документ.ТрансформационнаяКорректировка.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.ОперацияМСФО.ПустаяСсылка)))";
	
	Если ИдентификацияПродуктаУХКлиентСервер.ЭтоУправлениеХолдингом() Тогда
		ТекстУсловия =
			"	ВЫБОР КОГДА тк.ДокументПлан ССЫЛКА Документ.НачислениеОперацийМСФО ТОГДА 
			|		тк.СуммаФакт = тк.ДокументПлан.Сумма
			|	ИНАЧЕ тк.СуммаФакт = тк.ДокументПлан.СуммаОрганизации КОНЕЦ";
	Иначе
		ТекстУсловия = "тк.СуммаФакт = тк.ДокументПлан.Сумма";
	КонецЕсли;
	
	Возврат СтрЗаменить(ТекстЗапроса, "&УсловиеПоТипуКонфигурации", ТекстУсловия);
КонецФункции
	
#КонецОбласти

#КонецЕсли
